name: "ensemble-onnx"
platform: "ensemble"

input [
    {
        name: "feature"
        data_type: TYPE_FP32
        dims: [ -1, 13 ]
    }
]

output [
    {
        name: "output"
        data_type: TYPE_FP32
        dims: [ -1, 3]
    }
]

ensemble_scheduling {
    step [
        {
            model_name: "python-scaler"
            model_version: -1
            input_map {
                key: "feature"
                value: "feature"
            }
            output_map {
                key: "input"
                value: "input"
            }
        },
        {
            model_name: "onnx-classifier"
            model_version: -1
            input_map {
                key: "input"
                value: "input"
            }
            output_map {
                key: "output"
                value: "output"
            }
        }
    ]
}
